package fullerene

import "time"

var loc = time.FixedZone("Asia/Tokyo", 9)
var JapanesePublicHolidays = []Fullerene{
	Date(2016, 1, 1, 0, 0, 0, 0, loc),   //  元日
	Date(2016, 1, 11, 0, 0, 0, 0, loc),  //  成人の日
	Date(2016, 2, 11, 0, 0, 0, 0, loc),  //  建国記念の日
	Date(2016, 3, 20, 0, 0, 0, 0, loc),  //  春分の日
	Date(2016, 3, 21, 0, 0, 0, 0, loc),  //  振替休日
	Date(2016, 4, 29, 0, 0, 0, 0, loc),  //  昭和の日
	Date(2016, 5, 3, 0, 0, 0, 0, loc),   //  憲法記念日
	Date(2016, 5, 4, 0, 0, 0, 0, loc),   //  みどりの日
	Date(2016, 5, 5, 0, 0, 0, 0, loc),   //  こどもの日
	Date(2016, 7, 18, 0, 0, 0, 0, loc),  //  海の日
	Date(2016, 8, 11, 0, 0, 0, 0, loc),  //  山の日
	Date(2016, 9, 19, 0, 0, 0, 0, loc),  //  敬老の日
	Date(2016, 9, 22, 0, 0, 0, 0, loc),  //  秋分の日
	Date(2016, 10, 10, 0, 0, 0, 0, loc), //  体育の日
	Date(2016, 11, 3, 0, 0, 0, 0, loc),  //  文化の日
	Date(2016, 11, 23, 0, 0, 0, 0, loc), //  勤労感謝の日
	Date(2016, 12, 23, 0, 0, 0, 0, loc), //  天皇誕生日
	Date(2017, 1, 1, 0, 0, 0, 0, loc),   //  元日
	Date(2017, 1, 2, 0, 0, 0, 0, loc),   //  振替休日
	Date(2017, 1, 9, 0, 0, 0, 0, loc),   //  成人の日
	Date(2017, 2, 11, 0, 0, 0, 0, loc),  //  建国記念の日
	Date(2017, 3, 20, 0, 0, 0, 0, loc),  //  春分の日
	Date(2017, 4, 29, 0, 0, 0, 0, loc),  //  昭和の日
	Date(2017, 5, 3, 0, 0, 0, 0, loc),   //  憲法記念日
	Date(2017, 5, 4, 0, 0, 0, 0, loc),   //  みどりの日
	Date(2017, 5, 5, 0, 0, 0, 0, loc),   //  こどもの日
	Date(2017, 7, 17, 0, 0, 0, 0, loc),  //  海の日
	Date(2017, 8, 11, 0, 0, 0, 0, loc),  //  山の日
	Date(2017, 9, 18, 0, 0, 0, 0, loc),  //  敬老の日
	Date(2017, 9, 23, 0, 0, 0, 0, loc),  //  秋分の日
	Date(2017, 10, 9, 0, 0, 0, 0, loc),  //  体育の日
	Date(2017, 11, 3, 0, 0, 0, 0, loc),  //  文化の日
	Date(2017, 11, 23, 0, 0, 0, 0, loc), //  勤労感謝の日
	Date(2017, 12, 23, 0, 0, 0, 0, loc), //  天皇誕生日
}
